/******************************************************************************************************************
              ＤＸＦ  プログラムファイル (MDxf.cpp)

[機能] クラスセクションを読み飛ばす
[返値] = 0 正常  < 0エラー  > 0 警告 非表示項目である
******************************************************************************************************************/


#include	"MDxf.h"


MINT MDxfGetClsSec        (														// (  O) ｽﾃｰﾀｽ
							CStdioFile*			FLPtr)								// (I  ) ﾌｧｲﾙ識別子
{
	MINT			Status;															// ｽﾃｰﾀｽ
	MINT			Code;
	MCHAR			Data[512];


	Status = 0;


	// セクション終了もしくはエラーするまで読みとばし
	while  ((Status = MDxfGetLine(FLPtr, &Code, Data)) == 0) {
		if (BwsStrCmp(Data, BwsStr("ENDSEC")) == 0)  break;
	}

	return(Status);
}
/******************************************************************************************************************
[機能] オブジェクトセクションを読み飛ばす
[返値] = 0 正常  < 0エラー  > 0 警告 非表示項目である
******************************************************************************************************************/
MINT MDxfGetObjSec        (														// (  O) ｽﾃｰﾀｽ
							CStdioFile*			FLPtr)								// (I  ) ﾌｧｲﾙ識別子
{
	MINT			Status;															// ｽﾃｰﾀｽ
	MINT			Code;
	MCHAR			Data[512];


	Status = 0;


	// セクション終了もしくはエラーするまで読みとばし
	while  ((Status = MDxfGetLine(FLPtr, &Code, Data)) == 0) {
		if (BwsStrCmp(Data, BwsStr("ENDSEC")) == 0)  break;
	}

	return(Status);
}
