/********************************************************************************************************************************

              ＤＸＦ（Ｒ１４）出力(MDxfR14.h)

********************************************************************************************************************************/

#ifndef			_HSDXFR14_
	#define		_HSDXFR14_

#include		"HBase.h"


/******************************************************************************************************************
[ 機能 ]  ＤＸＦオープン（Ｒ１４形式）
******************************************************************************************************************/
CStdioFile*	 MDxfR14Open      (														// (  O) ﾌｧｲﾙ識別子
								MCHAR*				FlName,								// (I  ) ﾌｧｲﾙ名
								MINT				Option,								// (I  ) ｵﾌﾟｼｮﾝ
								MINT				NumPrim);							// (I  ) ﾌﾟﾘﾐﾃｲﾌﾞ数

/******************************************************************************************************************
[ 機能 ]  ＤＸＦクローズ（Ｒ１４形式）
******************************************************************************************************************/
HVOID MDxfR14Close            (
								CStdioFile*			FLPtr);								// (I  ) ﾌｧｲﾙ識別子

/******************************************************************************************************************
[ 機能 ]  スタイルの出力
******************************************************************************************************************/
MINT MDxfR14Style             (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ 
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I  ) ﾊﾝﾄﾞﾙ数
								MCHAR*				Style,								// (I  ) ｽﾀｲﾙ
								MCHAR*				FilelN,								// (I  ) ﾌｧｲﾙ名
								MCHAR*				FontN,								// (I  ) ﾌｫﾝﾄ名
								MCHAR*				Volue);								// (I  ) ﾎﾞﾘｭｰﾑ

/******************************************************************************************************************
[ 機能 ]  点の出力
******************************************************************************************************************/
MINT MDxfR14Dot               (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I/O) ﾊﾝﾄﾞﾙ数
								MCHAR*				LayNam,								// (I  ) ﾚｲﾔ名
								MINT				Color,								// (I  ) 色
								MINT				NumPnt,								// (I  ) 頂点数
								MgPoint2*			Pnt1);								// (I  ) 点

/******************************************************************************************************************
[ 機能 ]  線の出力
******************************************************************************************************************/
MINT MDxfR14Line              (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I/O) ﾊﾝﾄﾞﾙ数
								MCHAR*				LayNam,								// (I  ) ﾚｲﾔ名
								MINT				LType,								// (I  ) 線種
								MINT				Color,								// (I  ) 色
								MINT				NumPnt,								// (I  ) 頂点数
								MgPoint2*			Pnt);								// (I  ) 頂点

/******************************************************************************************************************
[ 機能 ]  円の出力
******************************************************************************************************************/
MINT MDxfR14Cir               (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I/O) ﾊﾝﾄﾞﾙ数
								MCHAR*				LayNam,								// (I  ) ﾚｲﾔ名
								MINT				LType,								// (I  ) 線種
								MINT				Color,								// (I  ) 色
								MgPoint2*			Pnt1,								// (I  ) 外接する左上
								MgPoint2*			Pnt2);								// (I  ) 外接する右下

/******************************************************************************************************************
[ 機能 ]  円弧の出力
******************************************************************************************************************/
MINT MDxfR14Arc               (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I/O) ﾊﾝﾄﾞﾙ数
								MCHAR*				LayNam,								// (I  ) ﾚｲﾔ名
								MINT				LType,								// (I  ) 線種
								MINT				Color,								// (I  ) 色
								MgPoint2*			Pnt1,								// (I  ) 外接する左上
								MgPoint2*			Pnt2,								// (I  ) 外接する右下
								MgPoint2*			Pnt3,								// (I  ) 描画開始点
								MgPoint2*			Pnt4);								// (I  ) 描画終了点

/******************************************************************************************************************
[ 機能 ]  文字の出力
******************************************************************************************************************/
MINT MDxfR14Text              (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I/O) ﾊﾝﾄﾞﾙ数
								MCHAR*				LayNam,								// (I  ) ﾚｲﾔ名
								MINT				Color,								// (I  ) 色
								MgPoint2*			Pnt1,								// (I  ) 文字配置点
								MgPoint2*			Pnt2,								// (I  ) 文字方向点
								MFLOAT				Height,								// (I  ) 文字高さ
								MCHAR*				String,								// (I  ) 文字列
								MINT				Italic,								// (I  ) ｲﾀﾘｯｸ   0:Off 1:On
								MCHAR*				SName);								// (I  ) 文字ﾀｲﾌﾟ

/******************************************************************************************************************
[ 機能 ]  漢字の出力
******************************************************************************************************************/
MINT MDxfR14Kanji             (														// (  O) ｽﾃｰﾀｽ   0:正常 1:ｴﾗｰ
								CStdioFile*			FLPtr,								// (I  ) ﾌｧｲﾙ識別子
								MINT*				NumHnd,								// (I/O) ﾊﾝﾄﾞﾙ数
								MCHAR*				LayNam,								// (I  ) ﾚｲﾔ名
								MINT				Color,								// (I  ) 色
								MINT				TFlag,								// (I  ) 縦ﾌﾗｸﾞ  0:横 1:縦
								MgPoint2*			Pnt1,								// (I  ) 文字配置点
								MgPoint2*			Pnt2,								// (I  ) 文字方向点
								MFLOAT				Height,								// (I  ) 文字高さ
								MCHAR*				String,								// (I  ) 文字列
								MINT				Italic,								// (I  ) ｲﾀﾘｯｸ   0:Off 1:On
								MCHAR*				SName);								// (I  ) 文字ﾀｲﾌﾟ


#endif			// _HSDXFR14_
