//==========================================================================================
//  Copyright (C) 2006-2008. K.Matsu. All rights reserved.
//
//  MODULE: .cpp
//
//		
//
//
//  K.Matsu           08/01/04    Created.
//==========================================================================================
#include "stdafx.h"
#include "McAPI.h"

namespace MC
{

void MCmdLine();

/////////////////////////////////////////////////////////////////////////////
//	ïîçﬁì¸óÕ
void MCmdPts()
{
//	MhInitInpAt();
	MCmdLine();
}

} // namespace MC