//==========================================================================================
//  Copyright (C) 2006-2008. K.Matsu. All rights reserved.
//
//  MODULE: MdMessage.cpp
//
//		メッセージ
//
//
//  K.Matsu           12/15/07    Created.
//==========================================================================================
#include "stdafx.h"
#include "MbBasic.h"
#include "MgDefine.h"
#include "MgPoint.h"
#include "MgRect.h"
#include "MgMat.h"

#include "MdModel.h"

namespace MC
{

//
//===========================================================================
//		メッセージ番号を指定したガイダンスメッセージの表示
//
MINT	MgmDispGuide (
						MINT		i_iGMsg		// ガイダンスメッセージ番号
				)
{
	return 0;
}

//
//===========================================================================
//		文字列を指定したガイダンスメッセージの表示
//
MINT	MgmDispGuideText (
						MCHAR		i_sGMsg		// メッセージ文字列
				)
{
	return 0;
}



//
//===========================================================================
//		ガイダンスメッセージの消去
//
MINT	MgmClearGuide ( )
{
	return 0;
}

//
//===========================================================================
//		エラーメッセージの表示
//
//		メッセージ番号を指定して、メッセージデータベースに登録されているエラーメッセージを表示する。
//		関数名とエラーコードは、エラーメッセージに付加して表示する。
//		指定されたメッセージ番号が、メッセージデータベースにない場合は、指定されたメッセージ番号を表示する。
//
MINT	MgmDispError (
						MCHAR		i_sMsg[],	// 関数名
						MINT		i_iEMsg,	// エラーメッセージ番号
						MINT		i_icdEMsg	// エラーコード
				)
{
	return 0;
}

} // namespace MC